Identifies the total number of animation frames for a single-day or multi-day study.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2011
 Syntax
  C#
public double NumberOfFrames { get; }
  Visual Basic
Public ReadOnly Property NumberOfFrames As Double
	Get
  Visual C++
public:
property double NumberOfFrames {
	double get ();
}
 See Also
  SunAndShadowSettings Class
  Autodesk.Revit.DB Namespace